package Quizki.Models;

/**
 * Реализация класса констант и переменных, задействованных в коде проекта.
 * Абстрагирование необходимых данных для простоты внесения изменений в код приложения.
 */

public class Variables {
    public static final int appHeight = 768;    // Высота окна приложения
    public static final int appWidth = 1024;    // Ширина окна приложения
    public static final String projectTitle = "Quizki";     // Название приложения
    public static final String card_filepath = "src/main/java/Quizki/Data/";    // Путь к файлу для создания JSON
    public static final String correctEmoji = "ヾ(≧▽≦*)o";   // Смешной смайлик правильного ответа
    public static final String wrongEmoji = "(┬┬﹏┬┬)";   // Смешной смайлик неправильного ответа
    public static final String backEmoji = "💀";   // Смешной смайлик кнопки "назад"

}